{
  "basics": {
    "name": "Willard Peralta Jr.",
    "label": "Application Engineer",
    "picture": "https://willardperalta.github.io/images/willardperalta2.jpg",
    "email": "willard.peralta@gmail.com",
    "phone": "808-385-5380",
    "website": "https://willardperalta.github.io",
    "summary": "Currently an Application Engineer at RCUH. I graduated from the University of Hawai'i at Mānoa in Spring 2020 with a Bachelor's of Science in Computer Science. My interests are in software engineering and web development.",
    "location": {
      "address": "",
      "postalCode": "96732",
      "city": "Kahului",
      "countryCode": "USA",
      "region": "Hawaii"
    },
    "profiles": [
      {
        "network": "github",
        "username": "willardperalta",
        "url": "http://github.com/willardperalta"
      },
      {
        "network": "linkedin",
        "username": "willardperalta",
        "url": "https://www.linkedin.com/in/willard-peralta-jr-2341b6139/"
      }
    ]
  },
  "interests": [
    {
      "name": "Software Engineering",
      "keywords": [
      ]
    },
    {
      "name": "Web Development",
      "keywords": [
      ]
    },
    {
      "name": "AI",
      "keywords": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "level": "",
      "keywords": [
        "Java",
        "Python",
        "Javascript",
        "HTML/CSS",
        "React",
        "C",
        "Bash",
        "C#"
      ]
    },
    {
      "name": "Toolsets/OS",
      "level": "",
      "keywords": [
        "MacOS",
        "Windows",
        "Linux",
        "Android"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Computer Science",
      "studyType": "B.S.",
      "startDate": "2017-09-01",
      "endDate": "2020-05-16",
      "gpa": "3.71",
      "courses": ["Design for Mobile Devices", "Video Game Design", "Python Image Processing Project", "Data Networks", "Operating Systems", "Software Engineering", "Database Systems", "AI Programming", "Algorithms", "Computer Vision", "Discrete Math"
      ]
    },
    {
      "institution": "University of Hawaii Maui College, Kahului, HI",
      "area": "Liberal Arts",
      "studyType": "A.A.",
      "startDate": "2015-09-01",
      "endDate": "2017-05-01",
      "gpa": "3.93",
      "courses": ["Intro to Computer Science"
      ]
    }
  ],
  "work": [
  	 {
      "company": "RCUH",
      "position": "Application Engineer",
      "website": "",
      "startDate": "2021-05-01",
      "endDate": "Present",
      "summary": "Designed, developed, tested, researched, and supported software applications at the MHPCC in order to provide HPC resources to DoD scientists and engineers, providing a low barrier to entry for novice HPC users as well as streamline work for advanced users.",
      "highlights": [
"• Development: Developed Single Page Applications with HTML, CSS, React and other modern web technologies. Supported and improved an existing HPC Portal web application that provides convenient web access to DoD HPC resources and applications such as HPC Batch Job submission.",
"• UI/UX design: Created basic wireframes, mockups, and prototypes. Basic Adobe Photoshop, Illustrator, and Adobe XD skills",
"• R&D for HPC interfaces: Conducted research of state of the art technologies in order to improve existing HPCUI solutions including cloud video streaming tech, user interfaces for Job management, and ML/AI platforms for handling Job workflows",
"• Technical Support: provided technical support and general administration of an Atlassian Tools centered web environment, Jira Project administration, Confluence Space migration",
"• Technologies/Processes: JavaScript, React, HTML/CSS, AJAX, NPM, Webpack, REST APIs, Web Browser API, Python, BASH, Linux, Unit testing, CI/CD, Git Version Control, RPMs, Jenkins, Atlassian tools, Agile"
      ]
    },
    {
      "company": "RCUH",
      "position": "Intern",
      "website": "",
      "startDate": "2020-05-26",
      "endDate": "2020-09-01",
      "summary": "Developed web based visualiztion tool to visualize cyber security data",
      "highlights": [
        "Built web based visualization illustrating large scale DoD cyber security data, which would integrate with another machine learning anomaly detection research project",
        "Researched, proposed, and implemented best tooling and processes which included a mix of Python, Numpy, Matplotlib, NetworkX, and Bokeh",
        "Improved number of visualized nodes by 1000%, from 10,000 nodes to 1,000,000 nodes",
        "Communicated with team twice daily via remote meetings to prioritize tasks and set goals",
        "Delivered five technical presentations to directors, mentors, and other interns"
      ]
    },
    {
      "company": "Hawaii State Digital Archives",
      "position": "Intern",
      "website": "",
      "startDate": "2019-01-01",
      "endDate": "2019-05-01",
      "summary": "Developed OCR web-microservice in Java",
      "highlights": [
        "Developed Optical Character Recognition web micro-service using tools such as Java, Git, Atlassian Tools, Maven, and Eclipse",
        "Independently researched Java OCR libraries and determined best library",
        "As Agile/Scrum devteam member, carried out dev tasks based on user stories using object-oriented programming, and communicated progress in daily stand ups",
        "Initiated the creation of documentation for merging branches and version control"
      ]
    },
    {
      "company": "UH Manoa East Asian Language and Literature",
      "position": "Website Assistant",
      "website": "https://www.hawaii.edu/eall/",
      "startDate": "2018-02-01",
      "endDate": "2019-01-01",
      "summary": "Maintained website for the Department of East Asian Literature and Languages at UH Manoa",
      "highlights": [
        "Fixed graduate faculty directory to allow easier access of graduate school information",
        "Initiated better design of home page to include mission statement and better news feed"
      ]
    },
    {
      "company": "Hifocused Cinematography",
      "position": "Video Editor",
      "website": "https://www.hifocused.com",
      "startDate": "2015-06-01",
      "endDate": "2020-05-01",
      "summary": "Edited wedding videos with Adobe Premiere Pro and Adobe Media Encoder",
      "highlights": [
        "Edited over 200 professional wedding videos, about 50% of all of the company’s total videos, therefore freeing up 2,000 hours of company time",
        "Synced video and audio, color corrected, organized footage, exported video files",
        "Edited full wedding highlight, feature, and doc videos in Final Cut 7 and Adobe Premiere Pro CC using creative narrative storytelling techniques."
      ]
    }
  ],
  "awards": [
    {
      "title": "UH Manoa Dean's List",
      "date": "2017, 2018, 2019, 2020",
      "awarder": "University of Hawaii at Manoa",
      "summary": "Earn a GPA of over 3.5 at the University of Hawaii at Manoa."
    }
  ],
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}
